{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "MacroKeyboard",
			"Children": [
				{
					"Source": {
						"Text": " det"
					},
					"Translation": {
						"Text": " 格"
					},
					"Key": "CapDetents"
				},
				{
					"Source": {
						"Text": " fr"
					},
					"Translation": {
						"Text": " 帧"
					},
					"Key": "CapFrames"
				},
				{
					"Source": {
						"Text": "Action"
					},
					"Translation": {
						"Text": "动作"
					},
					"Key": "SectionAction"
				},
				{
					"Source": {
						"Text": "Action type"
					},
					"Translation": {
						"Text": "动作类型"
					},
					"Key": "ActionLabel"
				},
				{
					"Source": {
						"Text": "All contexts (generic)"
					},
					"Translation": {
						"Text": "所有上下文（通用）"
					},
					"Key": "ContextAll"
				},
				{
					"Source": {
						"Text": "Animation Blueprint"
					},
					"Translation": {
						"Text": "动画蓝图"
					},
					"Key": "ContextAnimBP"
				},
				{
					"Source": {
						"Text": "Animation Editor"
					},
					"Translation": {
						"Text": "动画编辑器"
					},
					"Key": "ContextAnim"
				},
				{
					"Source": {
						"Text": "Anticlockwise"
					},
					"Translation": {
						"Text": "逆时针"
					},
					"Key": "LightDirCcw"
				},
				{
					"Source": {
						"Text": "Binding context"
					},
					"Translation": {
						"Text": "绑定上下文"
					},
					"Key": "CommandCtxLabel"
				},
				{
					"Source": {
						"Text": "Blocked"
					},
					"Translation": {
						"Text": "屏蔽"
					},
					"Key": "CapBlocked"
				},
				{
					"Source": {
						"Text": "Breathing"
					},
					"Translation": {
						"Text": "单色呼吸"
					},
					"Key": "LightMode4"
				},
				{
					"Source": {
						"Text": "Brightness"
					},
					"Translation": {
						"Text": "亮度"
					},
					"Key": "LightBright"
				},
				{
					"Source": {
						"Text": "Click a key on the pad to edit its binding; the backlight settings are on the right. The panel also opens as its own window from Window > Tools > MacroKeyboard."
					},
					"Translation": {
						"Text": "点击键盘上的按键编辑绑定；右侧是背光设置。也可以从 Window > Tools > MacroKeyboard 打开独立窗口。"
					},
					"Key": "PanelHint"
				},
				{
					"Source": {
						"Text": "Click a key, a knob zone or a joystick direction above to edit it; pressing a physical key highlights it."
					},
					"Translation": {
						"Text": "点击上方的按键、旋钮扇区或摇杆方向进行编辑；按下实体按键会高亮对应位置。"
					},
					"Key": "PickControl"
				},
				{
					"Source": {
						"Text": "Click a key, a knob zone or a joystick direction to edit what it does in the current context."
					},
					"Translation": {
						"Text": "点击按键、旋钮扇区或摇杆方向即可编辑它在当前上下文中的功能。"
					},
					"Key": "DeviceTip"
				},
				{
					"Source": {
						"Text": "Click to pick a colour"
					},
					"Translation": {
						"Text": "点击选择颜色"
					},
					"Key": "LightColorTip"
				},
				{
					"Source": {
						"Text": "Click, then press the key combination"
					},
					"Translation": {
						"Text": "点击后按下想要的组合键"
					},
					"Key": "ChordTip"
				},
				{
					"Source": {
						"Text": "Clockwise"
					},
					"Translation": {
						"Text": "顺时针"
					},
					"Key": "LightDirCw"
				},
				{
					"Source": {
						"Text": "Colour"
					},
					"Translation": {
						"Text": "色彩"
					},
					"Key": "LightColor"
				},
				{
					"Source": {
						"Text": "Command name"
					},
					"Translation": {
						"Text": "命令名"
					},
					"Key": "CommandNameLabel"
				},
				{
					"Source": {
						"Text": "Console command"
					},
					"Translation": {
						"Text": "控制台命令"
					},
					"Key": "ActionConsole"
				},
				{
					"Source": {
						"Text": "Console command"
					},
					"Translation": {
						"Text": "控制台命令"
					},
					"Key": "ConsoleLabel"
				},
				{
					"Source": {
						"Text": "Currently inherited from “All contexts”: {0}. Pick an action below to override it for this context only."
					},
					"Translation": {
						"Text": "当前继承自「所有上下文」：{0}。在下面选择动作，即可只为本上下文覆盖。"
					},
					"Key": "InheritedFmt"
				},
				{
					"Source": {
						"Text": "Cycling breath"
					},
					"Translation": {
						"Text": "循环呼吸"
					},
					"Key": "LightMode5"
				},
				{
					"Source": {
						"Text": "Default: {0}"
					},
					"Translation": {
						"Text": "默认：{0}"
					},
					"Key": "DisplayNameHint"
				},
				{
					"Source": {
						"Text": "Detents per trigger"
					},
					"Translation": {
						"Text": "每几格触发一次"
					},
					"Key": "DetentsLabel"
				},
				{
					"Source": {
						"Text": "Direction"
					},
					"Translation": {
						"Text": "方向"
					},
					"Key": "LightDir"
				},
				{
					"Source": {
						"Text": "Display name"
					},
					"Translation": {
						"Text": "显示名称"
					},
					"Key": "DisplayNameLabel"
				},
				{
					"Source": {
						"Text": "Each click of the knob reports several steps (2 on the W909): 2 means one trigger per click."
					},
					"Translation": {
						"Text": "旋钮转一档会上报多格（W909 为 2 格）：填 2 表示转一档触发一次。"
					},
					"Key": "DetentsTip"
				},
				{
					"Source": {
						"Text": "Editing context"
					},
					"Translation": {
						"Text": "编辑上下文"
					},
					"Key": "EditContext"
				},
				{
					"Source": {
						"Text": "Editor command (by name)"
					},
					"Translation": {
						"Text": "编辑器命令（按命令名）"
					},
					"Key": "ActionCommand"
				},
				{
					"Source": {
						"Text": "Editor shortcut"
					},
					"Translation": {
						"Text": "编辑器内快捷键"
					},
					"Key": "ActionChord"
				},
				{
					"Source": {
						"Text": "Flowing"
					},
					"Translation": {
						"Text": "行云流水"
					},
					"Key": "LightMode2"
				},
				{
					"Source": {
						"Text": "Follow editor"
					},
					"Translation": {
						"Text": "跟随编辑器"
					},
					"Key": "Follow"
				},
				{
					"Source": {
						"Text": "Frames per step"
					},
					"Translation": {
						"Text": "每次移动帧数"
					},
					"Key": "FramesLabel"
				},
				{
					"Source": {
						"Text": "Gives this context its own lighting, applied whenever it comes to the front"
					},
					"Translation": {
						"Text": "勾选后这个上下文有自己的灯光，切到它时自动应用"
					},
					"Key": "LightPerContextTip"
				},
				{
					"Source": {
						"Text": "Hold-to-turn multiplier"
					},
					"Translation": {
						"Text": "按住旋转倍数"
					},
					"Key": "HoldAccel"
				},
				{
					"Source": {
						"Text": "In this context the knob press is the hold-to-accelerate modifier: its binding runs on release, and not at all if the knob was turned while held."
					},
					"Translation": {
						"Text": "这个上下文里旋钮按下是「按住加速」的修饰键：它的绑定在松开时触发，按住期间转过旋钮则不触发。"
					},
					"Key": "KnobModifierNote"
				},
				{
					"Source": {
						"Text": "Joystick down"
					},
					"Translation": {
						"Text": "摇杆 下"
					},
					"Key": "CtrlJoyDown"
				},
				{
					"Source": {
						"Text": "Joystick left"
					},
					"Translation": {
						"Text": "摇杆 左"
					},
					"Key": "CtrlJoyLeft"
				},
				{
					"Source": {
						"Text": "Joystick press"
					},
					"Translation": {
						"Text": "摇杆 按下"
					},
					"Key": "CtrlJoyPress"
				},
				{
					"Source": {
						"Text": "Joystick right"
					},
					"Translation": {
						"Text": "摇杆 右"
					},
					"Key": "CtrlJoyRight"
				},
				{
					"Source": {
						"Text": "Joystick up"
					},
					"Translation": {
						"Text": "摇杆 上"
					},
					"Key": "CtrlJoyUp"
				},
				{
					"Source": {
						"Text": "Key settings"
					},
					"Translation": {
						"Text": "按键设置"
					},
					"Key": "BindingTitle"
				},
				{
					"Source": {
						"Text": "Knob"
					},
					"Translation": {
						"Text": "旋钮"
					},
					"Key": "SectionKnob"
				},
				{
					"Source": {
						"Text": "Knob left"
					},
					"Translation": {
						"Text": "旋钮 左旋"
					},
					"Key": "CtrlKnobCcw"
				},
				{
					"Source": {
						"Text": "Knob press"
					},
					"Translation": {
						"Text": "旋钮 按下"
					},
					"Key": "CtrlKnobPress"
				},
				{
					"Source": {
						"Text": "Knob right"
					},
					"Translation": {
						"Text": "旋钮 右旋"
					},
					"Key": "CtrlKnobCw"
				},
				{
					"Source": {
						"Text": "Level Editor"
					},
					"Translation": {
						"Text": "关卡编辑器"
					},
					"Key": "ContextLevel"
				},
				{
					"Source": {
						"Text": "Lighting for “{0}”"
					},
					"Translation": {
						"Text": "「{0}」专用灯光"
					},
					"Key": "LightOwnFmt"
				},
				{
					"Source": {
						"Text": "Macro pad"
					},
					"Translation": {
						"Text": "宏键盘"
					},
					"Key": "StatusLabel"
				},
				{
					"Source": {
						"Text": "Macro pad: MacroHub is connected but no pad was found\n{0}\nClick to open the setup panel"
					},
					"Translation": {
						"Text": "宏键盘：MacroHub 已连接，但没有检测到键盘\n{0}\n点击打开配置面板"
					},
					"Key": "StatusNoPad"
				},
				{
					"Source": {
						"Text": "Macro pad: MacroHub not connected (make sure MacroHub is running)\nClick to open the setup panel"
					},
					"Translation": {
						"Text": "宏键盘：未连接 MacroHub（确认 MacroHub 正在运行）\n点击打开配置面板"
					},
					"Key": "StatusOff"
				},
				{
					"Source": {
						"Text": "Macro pad: connected\n{0}\nClick to open the setup panel"
					},
					"Translation": {
						"Text": "宏键盘：已连接\n{0}\n点击打开配置面板"
					},
					"Key": "StatusOn"
				},
				{
					"Source": {
						"Text": "Macro pad: set what each control does per editor context"
					},
					"Translation": {
						"Text": "宏键盘：按编辑器上下文配置每个控件"
					},
					"Key": "PanelTooltip"
				},
				{
					"Source": {
						"Text": "MacroHub connected · pad not connected"
					},
					"Translation": {
						"Text": "MacroHub 已连接 · 键盘未连接"
					},
					"Key": "PadOffline"
				},
				{
					"Source": {
						"Text": "MacroHub connected · pad online"
					},
					"Translation": {
						"Text": "MacroHub 已连接 · 键盘在线"
					},
					"Key": "PadOnline"
				},
				{
					"Source": {
						"Text": "MacroHub not connected"
					},
					"Translation": {
						"Text": "MacroHub 未连接"
					},
					"Key": "HubOffline"
				},
				{
					"Source": {
						"Text": "MacroHub setup page"
					},
					"Translation": {
						"Text": "MacroHub 配置页"
					},
					"Key": "OpenHub"
				},
				{
					"Source": {
						"Text": "MacroKeyboard"
					},
					"Translation": {
						"Text": "MacroKeyboard"
					},
					"Key": "PanelTitle"
				},
				{
					"Source": {
						"Text": "MacroKeyboard is not initialised"
					},
					"Translation": {
						"Text": "MacroKeyboard 未初始化"
					},
					"Key": "NoSubsystem"
				},
				{
					"Source": {
						"Text": "Marquee"
					},
					"Translation": {
						"Text": "跑马"
					},
					"Key": "LightMode3"
				},
				{
					"Source": {
						"Text": "Mode"
					},
					"Translation": {
						"Text": "模式"
					},
					"Key": "LightMode"
				},
				{
					"Source": {
						"Text": "Neon"
					},
					"Translation": {
						"Text": "霓虹"
					},
					"Key": "LightMode7"
				},
				{
					"Source": {
						"Text": "None (block)"
					},
					"Translation": {
						"Text": "无（屏蔽）"
					},
					"Key": "ActionNone"
				},
				{
					"Source": {
						"Text": "Not taken over: MacroHub controls the backlight"
					},
					"Translation": {
						"Text": "未接管：背光由 MacroHub 决定"
					},
					"Key": "LightOff"
				},
				{
					"Source": {
						"Text": "Off"
					},
					"Translation": {
						"Text": "关灯"
					},
					"Key": "LightMode9"
				},
				{
					"Source": {
						"Text": "Open MacroHub’s device and forwarding settings in the browser"
					},
					"Translation": {
						"Text": "在浏览器里打开 MacroHub 的设备与转发设置"
					},
					"Key": "OpenHubTip"
				},
				{
					"Source": {
						"Text": "Open in its own window"
					},
					"Translation": {
						"Text": "在独立窗口中打开"
					},
					"Key": "OpenPanelWindow"
				},
				{
					"Source": {
						"Text": "Open this panel as a separate editor window"
					},
					"Translation": {
						"Text": "把这个面板作为独立的编辑器窗口打开"
					},
					"Key": "OpenPanelWindowTip"
				},
				{
					"Source": {
						"Text": "Pad lighting"
					},
					"Translation": {
						"Text": "键盘灯光"
					},
					"Key": "LightTitle"
				},
				{
					"Source": {
						"Text": "Per context"
					},
					"Translation": {
						"Text": "本上下文独立"
					},
					"Key": "LightPerContext"
				},
				{
					"Source": {
						"Text": "Pick an action to create a binding for this context."
					},
					"Translation": {
						"Text": "选择一个动作即可为该上下文创建绑定。"
					},
					"Key": "PickAction"
				},
				{
					"Source": {
						"Text": "Play/Pause"
					},
					"Translation": {
						"Text": "播放/暂停"
					},
					"Key": "CapPlayPause"
				},
				{
					"Source": {
						"Text": "Playing in Editor"
					},
					"Translation": {
						"Text": "PIE 运行中"
					},
					"Key": "ContextPie"
				},
				{
					"Source": {
						"Text": "Rainbow flow"
					},
					"Translation": {
						"Text": "流光溢彩"
					},
					"Key": "LightMode8"
				},
				{
					"Source": {
						"Text": "Remove binding"
					},
					"Translation": {
						"Text": "删除此绑定"
					},
					"Key": "ClearBinding"
				},
				{
					"Source": {
						"Text": "Removes this context’s binding; if there is an “All contexts” binding, the control inherits it again"
					},
					"Translation": {
						"Text": "删除这个上下文里的绑定；若有「所有上下文」的绑定，会回到继承它"
					},
					"Key": "ClearBindingTip"
				},
				{
					"Source": {
						"Text": "Replace every binding in every context with the plugin defaults? Your current bindings will be lost."
					},
					"Translation": {
						"Text": "用插件默认绑定替换所有上下文的全部绑定？当前的绑定会丢失。"
					},
					"Key": "RestoreDefaultsConfirm"
				},
				{
					"Source": {
						"Text": "Replace every binding in every context with the plugin’s defaults"
					},
					"Translation": {
						"Text": "用插件自带的默认绑定替换所有上下文的全部绑定"
					},
					"Key": "RestoreDefaultsTip"
				},
				{
					"Source": {
						"Text": "Restore default bindings…"
					},
					"Translation": {
						"Text": "恢复默认绑定…"
					},
					"Key": "RestoreDefaults"
				},
				{
					"Source": {
						"Text": "Sequencer"
					},
					"Translation": {
						"Text": "Sequencer"
					},
					"Key": "ContextSequencer"
				},
				{
					"Source": {
						"Text": "Setup panel"
					},
					"Translation": {
						"Text": "配置面板"
					},
					"Key": "PanelCategory"
				},
				{
					"Source": {
						"Text": "Shared by all contexts"
					},
					"Translation": {
						"Text": "所有上下文通用"
					},
					"Key": "LightShared"
				},
				{
					"Source": {
						"Text": "Shortcut"
					},
					"Translation": {
						"Text": "快捷键"
					},
					"Key": "ChordLabel"
				},
				{
					"Source": {
						"Text": "Simulate"
					},
					"Translation": {
						"Text": "Simulate"
					},
					"Key": "ContextSimulate"
				},
				{
					"Source": {
						"Text": "Solid"
					},
					"Translation": {
						"Text": "单色常亮"
					},
					"Key": "LightMode1"
				},
				{
					"Source": {
						"Text": "Speed"
					},
					"Translation": {
						"Text": "速度"
					},
					"Key": "LightSpeed"
				},
				{
					"Source": {
						"Text": "Speed acceleration"
					},
					"Translation": {
						"Text": "快转加速"
					},
					"Key": "KnobAccel"
				},
				{
					"Source": {
						"Text": "Take over"
					},
					"Translation": {
						"Text": "接管"
					},
					"Key": "LightDrive"
				},
				{
					"Source": {
						"Text": "Tetris"
					},
					"Translation": {
						"Text": "俄罗斯方块"
					},
					"Key": "LightMode6"
				},
				{
					"Source": {
						"Text": "Text shown on the key cap instead of the action summary (such as the shortcut). Leave empty for the default. Only affects this binding in this context."
					},
					"Translation": {
						"Text": "键帽上显示的文字，覆盖默认的动作摘要（如快捷键）。留空恢复默认。只影响本上下文的这个绑定。"
					},
					"Key": "DisplayNameTip"
				},
				{
					"Source": {
						"Text": "The edited context follows the editor’s focus; untick to choose one yourself"
					},
					"Translation": {
						"Text": "编辑的上下文跟随编辑器当前焦点；取消后可手动选择"
					},
					"Key": "FollowTip"
				},
				{
					"Source": {
						"Text": "Timeline play / pause"
					},
					"Translation": {
						"Text": "时间轴播放/暂停"
					},
					"Key": "ActionPlay"
				},
				{
					"Source": {
						"Text": "Timeline scrub"
					},
					"Translation": {
						"Text": "时间轴拖动"
					},
					"Key": "ActionScrub"
				},
				{
					"Source": {
						"Text": "Trigger"
					},
					"Translation": {
						"Text": "触发"
					},
					"Key": "SectionTrigger"
				},
				{
					"Source": {
						"Text": "Trigger on release (default: on press)"
					},
					"Translation": {
						"Text": "松开时触发（默认按下时触发）"
					},
					"Key": "OnRelease"
				},
				{
					"Source": {
						"Text": "Turning quickly moves further per step (×2 under 90 ms between steps, ×5 under 40 ms). Turn off when every click must be exactly one frame."
					},
					"Translation": {
						"Text": "快速转动时每次多走几帧（间隔 < 90 ms ×2，< 40 ms ×5）。要求严格一档一帧时关闭。"
					},
					"Key": "KnobAccelTip"
				},
				{
					"Source": {
						"Text": "Turning while holding the knob down multiplies each step by this; releasing the knob goes straight back to normal. 1 = off.\nAbove 1, the knob press’s own binding in this context runs on release, and not at all if the knob was turned while held."
					},
					"Translation": {
						"Text": "按住旋钮再转，每次移动乘以这个倍数；松开立即恢复。1 = 关闭。\n大于 1 时，这个上下文里「旋钮按下」自己的绑定改为松开时触发，按住期间转过旋钮就不触发。"
					},
					"Key": "HoldAccelTip"
				},
				{
					"Source": {
						"Text": "Unbound"
					},
					"Translation": {
						"Text": "未绑定"
					},
					"Key": "Unbound"
				},
				{
					"Source": {
						"Text": "Waiting for MacroHub to send the pad layout… (make sure MacroHub is running)"
					},
					"Translation": {
						"Text": "等待 MacroHub 发送设备布局…（请确认 MacroHub 正在运行）"
					},
					"Key": "NoDevice"
				},
				{
					"Source": {
						"Text": "When on, the editor sets the pad’s backlight per context; when off, MacroHub controls it again"
					},
					"Translation": {
						"Text": "打开后由编辑器按上下文控制键盘背光；关闭则交还给 MacroHub"
					},
					"Key": "LightDriveTip"
				},
				{
					"Source": {
						"Text": "e.g. Sequencer"
					},
					"Translation": {
						"Text": "例如 Sequencer"
					},
					"Key": "CommandCtxHint"
				},
				{
					"Source": {
						"Text": "e.g. TogglePlay"
					},
					"Translation": {
						"Text": "例如 TogglePlay"
					},
					"Key": "CommandNameHint"
				},
				{
					"Source": {
						"Text": "e.g. stat fps"
					},
					"Translation": {
						"Text": "例如 stat fps"
					},
					"Key": "ConsoleHint"
				},
				{
					"Source": {
						"Text": "in “{0}”"
					},
					"Translation": {
						"Text": "在「{0}」中"
					},
					"Key": "EditingFmt"
				},
				{
					"Source": {
						"Text": "setup panel keyboard lighting"
					},
					"Translation": {
						"Text": "配置面板 键盘 灯光 setup panel keyboard lighting"
					},
					"Key": "PanelRowFilter"
				},
				{
					"Source": {
						"Text": "{0} / 5"
					},
					"Translation": {
						"Text": "{0} / 5"
					},
					"Key": "LightSpeedFmt"
				},
				{
					"Source": {
						"Text": "{0} / 6"
					},
					"Translation": {
						"Text": "{0} / 6"
					},
					"Key": "LightBrightFmt"
				}
			]
		},
		{
			"Namespace": "UObjectCategory",
			"Children": [
				{
					"Source": {
						"Text": "Binding"
					},
					"Translation": {
						"Text": "绑定"
					},
					"Key": "Binding"
				},
				{
					"Source": {
						"Text": "Bindings"
					},
					"Translation": {
						"Text": "绑定"
					},
					"Key": "Bindings"
				},
				{
					"Source": {
						"Text": "Connection"
					},
					"Translation": {
						"Text": "连接"
					},
					"Key": "Connection"
				},
				{
					"Source": {
						"Text": "Diagnostics"
					},
					"Translation": {
						"Text": "诊断"
					},
					"Key": "Diagnostics"
				},
				{
					"Source": {
						"Text": "Lighting"
					},
					"Translation": {
						"Text": "灯光"
					},
					"Key": "Lighting"
				},
				{
					"Source": {
						"Text": "MacroKeyboard"
					},
					"Translation": {
						"Text": "宏键盘"
					},
					"Key": "MacroKeyboard"
				}
			]
		},
		{
			"Namespace": "UObjectDisplayNames",
			"Children": [
				{
					"Source": {
						"Text": "Action"
					},
					"Translation": {
						"Text": "动作"
					},
					"Key": "MacroKeyboardBinding:Action"
				},
				{
					"Source": {
						"Text": "Amount"
					},
					"Translation": {
						"Text": "帧数"
					},
					"Key": "MacroKeyboardBinding:Amount"
				},
				{
					"Source": {
						"Text": "App Id"
					},
					"Translation": {
						"Text": "应用 Id"
					},
					"Key": "MacroKeyboardSettings:AppId"
				},
				{
					"Source": {
						"Text": "Bindings"
					},
					"Translation": {
						"Text": "绑定"
					},
					"Key": "MacroKeyboardEditorSettings:Bindings"
				},
				{
					"Source": {
						"Text": "Brightness"
					},
					"Translation": {
						"Text": "亮度"
					},
					"Key": "MacroLightingSpec:Brightness"
				},
				{
					"Source": {
						"Text": "Chord"
					},
					"Translation": {
						"Text": "快捷键"
					},
					"Key": "EMacroEditorAction.Chord"
				},
				{
					"Source": {
						"Text": "Chord"
					},
					"Translation": {
						"Text": "快捷键"
					},
					"Key": "MacroKeyboardBinding:Chord"
				},
				{
					"Source": {
						"Text": "Color"
					},
					"Translation": {
						"Text": "颜色"
					},
					"Key": "MacroLightingSpec:Color"
				},
				{
					"Source": {
						"Text": "Command Context"
					},
					"Translation": {
						"Text": "命令上下文"
					},
					"Key": "MacroKeyboardBinding:CommandContext"
				},
				{
					"Source": {
						"Text": "Command Name"
					},
					"Translation": {
						"Text": "命令名"
					},
					"Key": "MacroKeyboardBinding:CommandName"
				},
				{
					"Source": {
						"Text": "Connected"
					},
					"Translation": {
						"Text": "已连接"
					},
					"Key": "EMacroHubConnection.Connected"
				},
				{
					"Source": {
						"Text": "Connecting"
					},
					"Translation": {
						"Text": "连接中"
					},
					"Key": "EMacroHubConnection.Connecting"
				},
				{
					"Source": {
						"Text": "Console Command"
					},
					"Translation": {
						"Text": "控制台命令"
					},
					"Key": "EMacroEditorAction.ConsoleCommand"
				},
				{
					"Source": {
						"Text": "Console Command"
					},
					"Translation": {
						"Text": "控制台命令"
					},
					"Key": "MacroKeyboardBinding:ConsoleCommand"
				},
				{
					"Source": {
						"Text": "Context"
					},
					"Translation": {
						"Text": "上下文"
					},
					"Key": "MacroContextLighting:Context"
				},
				{
					"Source": {
						"Text": "Context"
					},
					"Translation": {
						"Text": "上下文"
					},
					"Key": "MacroKeyboardBinding:Context"
				},
				{
					"Source": {
						"Text": "Context Lighting"
					},
					"Translation": {
						"Text": "上下文灯光"
					},
					"Key": "MacroKeyboardEditorSettings:ContextLighting"
				},
				{
					"Source": {
						"Text": "Context Name"
					},
					"Translation": {
						"Text": "上下文名称"
					},
					"Key": "MacroKeyboardSubsystem:ReportContext:ContextName"
				},
				{
					"Source": {
						"Text": "Control"
					},
					"Translation": {
						"Text": "控件"
					},
					"Key": "MacroControlEvent:Control"
				},
				{
					"Source": {
						"Text": "Control"
					},
					"Translation": {
						"Text": "控件"
					},
					"Key": "MacroKeyboardBinding:Control"
				},
				{
					"Source": {
						"Text": "Detail"
					},
					"Translation": {
						"Text": "详情"
					},
					"Key": "MacroKeyboardSubsystem:ReportContext:Detail"
				},
				{
					"Source": {
						"Text": "Detents Per Trigger"
					},
					"Translation": {
						"Text": "每几格触发一次"
					},
					"Key": "MacroKeyboardBinding:DetentsPerTrigger"
				},
				{
					"Source": {
						"Text": "Direction"
					},
					"Translation": {
						"Text": "方向"
					},
					"Key": "MacroLightingSpec:Direction"
				},
				{
					"Source": {
						"Text": "Disabled"
					},
					"Translation": {
						"Text": "已禁用"
					},
					"Key": "EMacroHubConnection.Disabled"
				},
				{
					"Source": {
						"Text": "Display Name"
					},
					"Translation": {
						"Text": "显示名称"
					},
					"Key": "MacroKeyboardBinding:DisplayName"
				},
				{
					"Source": {
						"Text": "Down"
					},
					"Translation": {
						"Text": "按下"
					},
					"Key": "EMacroControlPhase.Down"
				},
				{
					"Source": {
						"Text": "Drive Lighting"
					},
					"Translation": {
						"Text": "接管灯光"
					},
					"Key": "MacroKeyboardEditorSettings:bDriveLighting"
				},
				{
					"Source": {
						"Text": "EMacro Control Phase MAX"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "EMacroControlPhase.EMacroControlPhase_MAX"
				},
				{
					"Source": {
						"Text": "EMacro Editor Action MAX"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "EMacroEditorAction.EMacroEditorAction_MAX"
				},
				{
					"Source": {
						"Text": "EMacro Hub Connection MAX"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "EMacroHubConnection.EMacroHubConnection_MAX"
				},
				{
					"Source": {
						"Text": "Enabled"
					},
					"Translation": {
						"Text": "启用"
					},
					"Key": "MacroKeyboardSettings:bEnabled"
				},
				{
					"Source": {
						"Text": "Event"
					},
					"Translation": {
						"Text": "事件"
					},
					"Key": "OnMacroControlEventBP__DelegateSignature:Event"
				},
				{
					"Source": {
						"Text": "Hold Multiplier"
					},
					"Translation": {
						"Text": "按住旋转倍数"
					},
					"Key": "MacroKeyboardBinding:HoldMultiplier"
				},
				{
					"Source": {
						"Text": "Id"
					},
					"Translation": {
						"Text": "Id"
					},
					"Key": "MacroControlInfo:Id"
				},
				{
					"Source": {
						"Text": "Kind"
					},
					"Translation": {
						"Text": "类型"
					},
					"Key": "MacroControlEvent:Kind"
				},
				{
					"Source": {
						"Text": "Kind"
					},
					"Translation": {
						"Text": "类型"
					},
					"Key": "MacroControlInfo:Kind"
				},
				{
					"Source": {
						"Text": "Label"
					},
					"Translation": {
						"Text": "标签"
					},
					"Key": "MacroControlInfo:Label"
				},
				{
					"Source": {
						"Text": "Lighting"
					},
					"Translation": {
						"Text": "灯光"
					},
					"Key": "MacroContextLighting:Lighting"
				},
				{
					"Source": {
						"Text": "Log Control Events"
					},
					"Translation": {
						"Text": "记录按键日志"
					},
					"Key": "MacroKeyboardEditorSettings:bLogControlEvents"
				},
				{
					"Source": {
						"Text": "Log Raw Hub Events"
					},
					"Translation": {
						"Text": "记录 Hub 原始事件"
					},
					"Key": "MacroKeyboardSettings:bLogEvents"
				},
				{
					"Source": {
						"Text": "Macro Context Lighting"
					},
					"Translation": {
						"Text": "上下文灯光"
					},
					"Key": "MacroContextLighting"
				},
				{
					"Source": {
						"Text": "Macro Control Event"
					},
					"Translation": {
						"Text": "宏键盘控件事件"
					},
					"Key": "MacroControlEvent"
				},
				{
					"Source": {
						"Text": "Macro Control Info"
					},
					"Translation": {
						"Text": "宏键盘控件信息"
					},
					"Key": "MacroControlInfo"
				},
				{
					"Source": {
						"Text": "Macro Keyboard Binding"
					},
					"Translation": {
						"Text": "宏键盘绑定"
					},
					"Key": "MacroKeyboardBinding"
				},
				{
					"Source": {
						"Text": "Macro Keyboard Subsystem"
					},
					"Translation": {
						"Text": "宏键盘子系统"
					},
					"Key": "MacroKeyboardSubsystem"
				},
				{
					"Source": {
						"Text": "Macro Lighting Spec"
					},
					"Translation": {
						"Text": "宏键盘灯光"
					},
					"Key": "MacroLightingSpec"
				},
				{
					"Source": {
						"Text": "MacroKeyboard"
					},
					"Translation": {
						"Text": "宏键盘"
					},
					"Key": "MacroKeyboardSettings"
				},
				{
					"Source": {
						"Text": "MacroKeyboard (Editor)"
					},
					"Translation": {
						"Text": "宏键盘（编辑器）"
					},
					"Key": "MacroKeyboardEditorSettings"
				},
				{
					"Source": {
						"Text": "Mode"
					},
					"Translation": {
						"Text": "模式"
					},
					"Key": "MacroLightingSpec:Mode"
				},
				{
					"Source": {
						"Text": "None"
					},
					"Translation": {
						"Text": "无"
					},
					"Key": "EMacroEditorAction.None"
				},
				{
					"Source": {
						"Text": "On Control Event BP"
					},
					"Translation": {
						"Text": "控件事件（蓝图）"
					},
					"Key": "MacroKeyboardSubsystem:OnControlEventBP"
				},
				{
					"Source": {
						"Text": "On Release"
					},
					"Translation": {
						"Text": "松开时触发"
					},
					"Key": "MacroKeyboardBinding:bOnRelease"
				},
				{
					"Source": {
						"Text": "Part"
					},
					"Translation": {
						"Text": "部位"
					},
					"Key": "MacroControlEvent:Part"
				},
				{
					"Source": {
						"Text": "Part"
					},
					"Translation": {
						"Text": "部位"
					},
					"Key": "MacroControlInfo:Part"
				},
				{
					"Source": {
						"Text": "Phase"
					},
					"Translation": {
						"Text": "阶段"
					},
					"Key": "MacroControlEvent:Phase"
				},
				{
					"Source": {
						"Text": "Pipe Name"
					},
					"Translation": {
						"Text": "管道名"
					},
					"Key": "MacroKeyboardSettings:PipeName"
				},
				{
					"Source": {
						"Text": "Reconnect Seconds"
					},
					"Translation": {
						"Text": "重连间隔（秒）"
					},
					"Key": "MacroKeyboardSettings:ReconnectSeconds"
				},
				{
					"Source": {
						"Text": "Rect"
					},
					"Translation": {
						"Text": "矩形"
					},
					"Key": "MacroControlInfo:Rect"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "返回值"
					},
					"Key": "MacroKeyboardSubsystem:DescribeConnection:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "返回值"
					},
					"Key": "MacroKeyboardSubsystem:GetConnectionState:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "返回值"
					},
					"Key": "MacroKeyboardSubsystem:GetControls:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "返回值"
					},
					"Key": "MacroKeyboardSubsystem:GetReportedContext:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "返回值"
					},
					"Key": "MacroKeyboardSubsystem:IsConnected:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "返回值"
					},
					"Key": "MacroKeyboardSubsystem:IsPadConnected:ReturnValue"
				},
				{
					"Source": {
						"Text": "Seq"
					},
					"Translation": {
						"Text": "序号"
					},
					"Key": "MacroControlEvent:Seq"
				},
				{
					"Source": {
						"Text": "Source"
					},
					"Translation": {
						"Text": "来源"
					},
					"Key": "MacroControlEvent:Source"
				},
				{
					"Source": {
						"Text": "Spec"
					},
					"Translation": {
						"Text": "灯光"
					},
					"Key": "MacroKeyboardSubsystem:SetLighting:Spec"
				},
				{
					"Source": {
						"Text": "Speed"
					},
					"Translation": {
						"Text": "速度"
					},
					"Key": "MacroLightingSpec:Speed"
				},
				{
					"Source": {
						"Text": "Speed Acceleration"
					},
					"Translation": {
						"Text": "快转加速"
					},
					"Key": "MacroKeyboardBinding:bSpeedAcceleration"
				},
				{
					"Source": {
						"Text": "Timeline Play Pause"
					},
					"Translation": {
						"Text": "时间轴播放/暂停"
					},
					"Key": "EMacroEditorAction.TimelinePlayPause"
				},
				{
					"Source": {
						"Text": "Timeline Scrub"
					},
					"Translation": {
						"Text": "时间轴拖动"
					},
					"Key": "EMacroEditorAction.TimelineScrub"
				},
				{
					"Source": {
						"Text": "Timestamp Ms"
					},
					"Translation": {
						"Text": "时间戳（毫秒）"
					},
					"Key": "MacroControlEvent:TimestampMs"
				},
				{
					"Source": {
						"Text": "UICommand"
					},
					"Translation": {
						"Text": "编辑器命令"
					},
					"Key": "EMacroEditorAction.UICommand"
				},
				{
					"Source": {
						"Text": "Up"
					},
					"Translation": {
						"Text": "松开"
					},
					"Key": "EMacroControlPhase.Up"
				}
			]
		},
		{
			"Namespace": "UObjectToolTips",
			"Children": [
				{
					"Source": {
						"Text": "\"key\", \"knob\" or \"joystick\"."
					},
					"Translation": {
						"Text": "\"key\"、\"knob\" 或 \"joystick\"。"
					},
					"Key": "MacroControlEvent:Kind"
				},
				{
					"Source": {
						"Text": "\"key\", \"knob\" or \"joystick\"."
					},
					"Translation": {
						"Text": "\"key\"、\"knob\" 或 \"joystick\"。"
					},
					"Key": "MacroControlInfo:Kind"
				},
				{
					"Source": {
						"Text": "\"pad\" for the physical device, \"simulate\" for the Hub's web UI / tests."
					},
					"Translation": {
						"Text": "\"pad\" 为实体设备，\"simulate\" 为 Hub 网页界面 / 测试模拟。"
					},
					"Key": "MacroControlEvent:Source"
				},
				{
					"Source": {
						"Text": "0 (slowest) to 5 (fastest); only the animated effects use it."
					},
					"Translation": {
						"Text": "0（最慢）到 5（最快）；只有动态灯效使用。"
					},
					"Key": "MacroLightingSpec:Speed"
				},
				{
					"Source": {
						"Text": "0 or 1; only the flowing effects use it."
					},
					"Translation": {
						"Text": "0 或 1；只有流动类灯效使用。"
					},
					"Key": "MacroLightingSpec:Direction"
				},
				{
					"Source": {
						"Text": "1 (dimmest) to 6 (brightest)."
					},
					"Translation": {
						"Text": "1（最暗）到 6（最亮）。"
					},
					"Key": "MacroLightingSpec:Brightness"
				},
				{
					"Source": {
						"Text": "A control as described by MacroHub (welcome / profile message): what it is called and where it sits on the device,\nso a UI can draw the pad without knowing the hardware."
					},
					"Translation": {
						"Text": "MacroHub 描述的一个控件（welcome / profile 消息）：名称和它在设备上的位置，\n这样界面不需要了解硬件就能画出键盘。"
					},
					"Key": "MacroControlInfo"
				},
				{
					"Source": {
						"Text": "Backlight state of the pad, mirroring what MacroHub's own lighting panel offers. The Hub clamps anything out of\nrange, so these are the values the firmware actually has."
					},
					"Translation": {
						"Text": "键盘背光状态，与 MacroHub 自己的灯光面板一致。超出范围的值由 Hub 截断，\n所以这些就是固件实际支持的值。"
					},
					"Key": "MacroLightingSpec"
				},
				{
					"Source": {
						"Text": "Backlight to apply while a given editor context is in front."
					},
					"Translation": {
						"Text": "某个编辑器上下文在前台时使用的背光。"
					},
					"Key": "MacroContextLighting"
				},
				{
					"Source": {
						"Text": "Binding context of the command, e.g. \"LevelEditor\", \"Sequencer\" (Action = UICommand)."
					},
					"Translation": {
						"Text": "命令所属的绑定上下文，例如 \"LevelEditor\"、\"Sequencer\"（动作 = 编辑器命令）。"
					},
					"Key": "MacroKeyboardBinding:CommandContext"
				},
				{
					"Source": {
						"Text": "Blueprint listeners."
					},
					"Translation": {
						"Text": "蓝图监听者。"
					},
					"Key": "MacroKeyboardSubsystem:OnControlEventBP"
				},
				{
					"Source": {
						"Text": "Command name inside that context, e.g. \"Undo\" (Action = UICommand)."
					},
					"Translation": {
						"Text": "该上下文中的命令名，例如 \"Undo\"（动作 = 编辑器命令）。"
					},
					"Key": "MacroKeyboardBinding:CommandName"
				},
				{
					"Source": {
						"Text": "Connect to MacroHub. Turn off to leave the pad to MacroHub's own shortcut layers."
					},
					"Translation": {
						"Text": "连接 MacroHub。关闭后键盘交给 MacroHub 自己的快捷键层处理。"
					},
					"Key": "MacroKeyboardSettings:bEnabled"
				},
				{
					"Source": {
						"Text": "Connection state of the MacroHub client."
					},
					"Translation": {
						"Text": "MacroHub 客户端的连接状态。"
					},
					"Key": "EMacroHubConnection"
				},
				{
					"Source": {
						"Text": "Console / editor command (Action = ConsoleCommand)."
					},
					"Translation": {
						"Text": "控制台 / 编辑器命令（动作 = 控制台命令）。"
					},
					"Key": "MacroKeyboardBinding:ConsoleCommand"
				},
				{
					"Source": {
						"Text": "Context id reported by the plugin: levelEditor, sequencer, animation, animBlueprint, pie, simulate, editor…"
					},
					"Translation": {
						"Text": "插件回报的上下文 id：levelEditor、sequencer、animation、animBlueprint、pie、simulate、editor…"
					},
					"Key": "MacroKeyboardBinding:Context"
				},
				{
					"Source": {
						"Text": "Context id; empty applies to every context that has none of its own."
					},
					"Translation": {
						"Text": "上下文 id；留空则用于所有没有专用灯光的上下文。"
					},
					"Key": "MacroContextLighting:Context"
				},
				{
					"Source": {
						"Text": "Control id from MacroHub: K1…K9, K0, KDOT, KENTER, KMINUS, KPLUS, KSPACE, KNOB_CW/CCW/PRESS, JOY_*."
					},
					"Translation": {
						"Text": "MacroHub 的控件 id：K1…K9、K0、KDOT、KENTER、KMINUS、KPLUS、KSPACE、KNOB_CW/CCW/PRESS、JOY_*。"
					},
					"Key": "MacroKeyboardBinding:Control"
				},
				{
					"Source": {
						"Text": "Detents per trigger for a rotary control: the pad reports several steps per physical click, so 3 here means\none click moves the timeline once. 1 acts on every step."
					},
					"Translation": {
						"Text": "旋转类控件每几格触发一次：键盘每转一档会上报多格，这里填 3 表示\n转一档移动一次时间轴。1 表示每格都触发。"
					},
					"Key": "MacroKeyboardBinding:DetentsPerTrigger"
				},
				{
					"Source": {
						"Text": "Editor Preferences → Plugins → MacroKeyboard (Editor): which control does what in which editor."
					},
					"Translation": {
						"Text": "编辑器偏好设置 → 插件 → 宏键盘（编辑器）：哪个控件在哪个编辑器里做什么。"
					},
					"Key": "MacroKeyboardEditorSettings"
				},
				{
					"Source": {
						"Text": "Effect: 1 Solid · 2 Flowing · 3 Marquee · 4 Breathing · 5 Cycling breath · 6 Tetris · 7 Neon · 8 Rainbow flow · 9 Off"
					},
					"Translation": {
						"Text": "灯效：1 单色常亮 · 2 行云流水 · 3 跑马 · 4 单色呼吸 · 5 循环呼吸 · 6 俄罗斯方块 · 7 霓虹 · 8 流光溢彩 · 9 关灯"
					},
					"Key": "MacroLightingSpec:Mode"
				},
				{
					"Source": {
						"Text": "Execute a console / editor command, e.g. \"stat fps\"."
					},
					"Translation": {
						"Text": "执行控制台 / 编辑器命令，例如 \"stat fps\"。"
					},
					"Key": "EMacroEditorAction.ConsoleCommand"
				},
				{
					"Source": {
						"Text": "Frames per trigger; rotary controls use the direction of the turn (Action = TimelineScrub)."
					},
					"Translation": {
						"Text": "每次触发移动的帧数；旋转类控件按旋转方向（动作 = 时间轴拖动）。"
					},
					"Key": "MacroKeyboardBinding:Amount"
				},
				{
					"Source": {
						"Text": "Hub monotonic timestamp in milliseconds — use the delta between detents for knob acceleration."
					},
					"Translation": {
						"Text": "Hub 单调时间戳（毫秒）——用相邻两格的时间差计算旋钮加速。"
					},
					"Key": "MacroControlEvent:TimestampMs"
				},
				{
					"Source": {
						"Text": "Identifies this client in MacroHub's web UI."
					},
					"Translation": {
						"Text": "在 MacroHub 网页界面中标识这个客户端。"
					},
					"Key": "MacroKeyboardSettings:AppId"
				},
				{
					"Source": {
						"Text": "Layout rectangle in key-width units: position and size on the device."
					},
					"Translation": {
						"Text": "以键宽为单位的布局矩形：在设备上的位置和大小。"
					},
					"Key": "MacroControlInfo:Rect"
				},
				{
					"Source": {
						"Text": "Let the editor tint the pad: each context below gets its own backlight while it is in front."
					},
					"Translation": {
						"Text": "由编辑器控制键盘背光：下面的每个上下文在前台时使用自己的背光。"
					},
					"Key": "MacroKeyboardEditorSettings:bDriveLighting"
				},
				{
					"Source": {
						"Text": "Logical control id, e.g. \"K1\", \"KNOB_CW\", \"JOY_PRESS\"."
					},
					"Translation": {
						"Text": "逻辑控件 id，例如 \"K1\"、\"KNOB_CW\"、\"JOY_PRESS\"。"
					},
					"Key": "MacroControlEvent:Control"
				},
				{
					"Source": {
						"Text": "Look the shortcut up by command name and send it — survives users rebinding the command."
					},
					"Translation": {
						"Text": "按命令名查找快捷键再发送——用户改了快捷键也能用。"
					},
					"Key": "EMacroEditorAction.UICommand"
				},
				{
					"Source": {
						"Text": "Move the Sequencer playhead / animation preview time. Rotary controls scrub by their turn direction."
					},
					"Translation": {
						"Text": "移动 Sequencer 播放头 / 动画预览时间。旋转类控件按旋转方向拖动。"
					},
					"Key": "EMacroEditorAction.TimelineScrub"
				},
				{
					"Source": {
						"Text": "Name shown on the key cap in the MacroKeyboard panel; empty shows the action itself (e.g. the shortcut)."
					},
					"Translation": {
						"Text": "MacroKeyboard 面板键帽上显示的名称；留空则显示动作本身（例如快捷键）。"
					},
					"Key": "MacroKeyboardBinding:DisplayName"
				},
				{
					"Source": {
						"Text": "Named pipe published by MacroHub (its --pipe argument), without the \\\\.\\pipe\\ prefix."
					},
					"Translation": {
						"Text": "MacroHub 发布的命名管道（它的 --pipe 参数），不含 \\\\.\\pipe\\ 前缀。"
					},
					"Key": "MacroKeyboardSettings:PipeName"
				},
				{
					"Source": {
						"Text": "Nothing (use to shadow a broader binding in one context)."
					},
					"Translation": {
						"Text": "什么都不做（用于在某个上下文里屏蔽更通用的绑定）。"
					},
					"Key": "EMacroEditorAction.None"
				},
				{
					"Source": {
						"Text": "One binding: \"in this context, this control does this\".\nContext matching is exact; leave it empty to apply in every context that has no more specific binding."
					},
					"Translation": {
						"Text": "一条绑定：“在这个上下文里，这个控件做这件事”。\n上下文精确匹配；留空则用于所有没有更具体绑定的上下文。"
					},
					"Key": "MacroKeyboardBinding"
				},
				{
					"Source": {
						"Text": "One control event as sent by MacroHub (protocol v2, \"control\" message).\nControl ids come from the Hub's device map, e.g. K1, KNOB_CW, JOY_UP."
					},
					"Translation": {
						"Text": "MacroHub 发来的一个控件事件（协议 v2 的 \"control\" 消息）。\n控件 id 来自 Hub 的设备映射，例如 K1、KNOB_CW、JOY_UP。"
					},
					"Key": "MacroControlEvent"
				},
				{
					"Source": {
						"Text": "Owns the MacroHub connection and delivers control events on the game thread.\n\nLives in the editor and in game builds; the editor module adds context detection and editor actions on top.\nEvents arrive on a background thread and are drained once per frame, so handlers run at a predictable point."
					},
					"Translation": {
						"Text": "持有 MacroHub 连接，并在游戏线程上分发控件事件。\n\n编辑器和游戏版本中都存在；编辑器模块在此之上增加上下文识别和编辑器动作。\n事件在后台线程到达，每帧统一处理一次，因此处理函数在可预期的时机运行。"
					},
					"Key": "MacroKeyboardSubsystem"
				},
				{
					"Source": {
						"Text": "Per-connection sequence number; a gap means the game thread stalled and the Hub dropped queued events."
					},
					"Translation": {
						"Text": "每个连接独立的序号；出现跳号说明游戏线程卡顿，Hub 丢弃了积压的事件。"
					},
					"Key": "MacroControlEvent:Seq"
				},
				{
					"Source": {
						"Text": "Play or pause the Sequencer / animation preview."
					},
					"Translation": {
						"Text": "播放或暂停 Sequencer / 动画预览。"
					},
					"Key": "EMacroEditorAction.TimelinePlayPause"
				},
				{
					"Source": {
						"Text": "Press or release of a control. Rotary controls send one Down/Up pair per detent."
					},
					"Translation": {
						"Text": "控件的按下或松开。旋转类控件每格发送一对按下/松开。"
					},
					"Key": "EMacroControlPhase"
				},
				{
					"Source": {
						"Text": "Project Settings → Plugins → MacroKeyboard."
					},
					"Translation": {
						"Text": "项目设置 → 插件 → 宏键盘。"
					},
					"Key": "MacroKeyboardSettings"
				},
				{
					"Source": {
						"Text": "Rotary controls: how much further a detent moves while the knob is held down during the turn. 1 turns it off.\nWhen a context uses it, the knob press becomes a modifier there and its own binding runs as a click on release."
					},
					"Translation": {
						"Text": "旋转类控件：按住旋钮旋转时每格移动的倍数。1 为关闭。\n某个上下文使用它时，该上下文里旋钮按下变成修饰键，它自己的绑定改为松开时作为单击触发。"
					},
					"Key": "MacroKeyboardBinding:HoldMultiplier"
				},
				{
					"Source": {
						"Text": "Rotary controls: turning quickly moves further per detent (2x under 90 ms, 5x under 40 ms between detents)."
					},
					"Translation": {
						"Text": "旋转类控件：转得快时每格走得更远（格间隔 < 90 ms ×2，< 40 ms ×5）。"
					},
					"Key": "MacroKeyboardBinding:bSpeedAcceleration"
				},
				{
					"Source": {
						"Text": "Run on release instead of press."
					},
					"Translation": {
						"Text": "在松开时而不是按下时执行。"
					},
					"Key": "MacroKeyboardBinding:bOnRelease"
				},
				{
					"Source": {
						"Text": "Seconds between reconnect attempts while MacroHub is not running (grows up to 4x)."
					},
					"Translation": {
						"Text": "MacroHub 未运行时两次重连之间的秒数（最多增长到 4 倍）。"
					},
					"Key": "MacroKeyboardSettings:ReconnectSeconds"
				},
				{
					"Source": {
						"Text": "Send a keyboard shortcut inside Unreal (Slate routing, not the operating system)."
					},
					"Translation": {
						"Text": "在 Unreal 内部发送键盘快捷键（经 Slate 路由，不经过操作系统）。"
					},
					"Key": "EMacroEditorAction.Chord"
				},
				{
					"Source": {
						"Text": "Shortcut to send (Action = Chord)."
					},
					"Translation": {
						"Text": "要发送的快捷键（动作 = 快捷键）。"
					},
					"Key": "MacroKeyboardBinding:Chord"
				},
				{
					"Source": {
						"Text": "Sub-part of a knob/joystick: cw, ccw, press, up, down, left, right."
					},
					"Translation": {
						"Text": "旋钮/摇杆的部位：cw、ccw、press、up、down、left、right。"
					},
					"Key": "MacroControlEvent:Part"
				},
				{
					"Source": {
						"Text": "Sub-part of a knob/joystick: cw, ccw, press, up, down, left, right."
					},
					"Translation": {
						"Text": "旋钮/摇杆的部位：cw、ccw、press、up、down、left、right。"
					},
					"Key": "MacroControlInfo:Part"
				},
				{
					"Source": {
						"Text": "What a control does in a given editor context."
					},
					"Translation": {
						"Text": "控件在某个编辑器上下文中执行的动作。"
					},
					"Key": "EMacroEditorAction"
				},
				{
					"Source": {
						"Text": "Write every control the editor acts on to the Output Log (\"KNOB_CW [sequencer] -> timeline scrub…\").\nOff by default; the same lines stay available at Verbose (`log LogMacroKeyboard Verbose`)."
					},
					"Translation": {
						"Text": "把编辑器执行的每个控件写入输出日志（\"KNOB_CW [sequencer] -> timeline scrub…\"）。\n默认关闭；关闭时同样的内容仍可在 Verbose 级别查看（`log LogMacroKeyboard Verbose`）。"
					},
					"Key": "MacroKeyboardEditorSettings:bLogControlEvents"
				},
				{
					"Source": {
						"Text": "Write every raw control event received from MacroHub to the Output Log (\"KNOB_CW down (knob/cw seq=…)\").\nOff by default. What the editor then does with each event has its own switch in Editor Preferences →\nPlugins → MacroKeyboard (Editor) → Diagnostics."
					},
					"Translation": {
						"Text": "把从 MacroHub 收到的每个原始控件事件写入输出日志（\"KNOB_CW down (knob/cw seq=…)\"）。\n默认关闭。编辑器对每个事件做了什么由 编辑器偏好设置 →\n插件 → 宏键盘（编辑器）→ 诊断 里的单独开关记录。"
					},
					"Key": "MacroKeyboardSettings:bLogEvents"
				}
			]
		}
	]
}